# -*- coding: cp1251 -*-

#Задание 1
kind = input("Введите вид питомца:")
name = input("Введите кличку питомца:")
age = input("Введите возраст питомца:")

print ("Это %s по кличке \"%s\". Возраст: %s года."%(kind,name,age))

#Задание 2
print("Введите все этапы человеческого развития")

stage1=input("Этап 1:")
stage2=input("Этап 2:")
stage3=input("Этап 3:")
stage4=input("Этап 4:")
stage5=input("Этап 5:")
stage6=input("Этап 6:")

print("Ваш ответ:")
print(stage1, stage2, stage3, stage4, stage5, stage6, sep=" => ")
